import 'package:flutter_application_military_directory/data/drugs/drug_model.dart';

final List<DrugModel> drugList = [
  DrugModel(
    description:
        'Опиоидный анальгетик, частичный агонист μ-рецепторов с некоторой антагонистической активностью в отношении κ-рецепторов. По эффективности несколько уступает морфину. Продолжительность действия больше, чем у морфина - около 6 ч, что обусловлено более прочным связыванием с рецепторами. Угнетает дыхательный центр в меньшей степени, чем морфин.',
    group: 'Опиоидные анальгетки',
    id: 3,
    name: "Бупренорфин",
    sideEffects:
        'Со стороны пищеварительной системы: тошнота, рвота, сухость во рту.Со стороны ЦНС: головная боль, депрессия, заторможенность, угнетение дыхательного центра, замедление скорости психических и двигательных реакций.Со стороны сердечно-сосудистой системы: снижение АД.Прочие: одышка, повышенное потоотделение, кожная сыпь.',
    latinName: 'Buprenorphine',
    indications: 'Острая и хроническая боль.',
    contraindications:
        'Угнетение дыхательного центра, беременность, лактация, детский возраст до 12 лет, повышенная чувствительность к бупренорфину.',
    dosage: '',
    releaseForm: '',
    form: 'Шприц-тюбик, ампулы',
    caution:
        'При нарушении функции дыхания, при печеночной и/или почечной недостаточности, микседеме, гипотиреозе, надпочечниковой недостаточности, угнетении ЦНС, черепно-мозговой травме, токсическом психозе, гипертрофии предстательной железы',
    interaction:
        'потенцирует действие опиоидных анальгетиков, фенотиазинов, анксиолитиков, седативных, снотворных, средств для наркоза, этанола, ингибиторов МАО.',
    additionial:
        'Способ введения: внутримышечно с интервалом 6-8 ч \nНачало действия: через 10-15 минут \nДлительность действия: 2 – 7 ч',
  ),
];
